Revit 2027 API
ItemFactoryBase.NewDetailCurveArray Method
 Creates an array of new detail curve elements.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DetailCurveArray NewDetailCurveArray(
	View view,
	CurveArray geometryCurveArray
)
Public Function NewDetailCurveArray (
	view As View,
	geometryCurveArray As CurveArray
) As DetailCurveArray
public:
DetailCurveArray^ NewDetailCurveArray(
	View^ view,
	CurveArray^ geometryCurveArray
)
member NewDetailCurveArray :
        view : View *
        geometryCurveArray : CurveArray -> DetailCurveArray
Parameters
view View
 The view in which the detail curves are to be visible.
geometryCurveArray CurveArray
 An array containing the internal geometry curves for detail lines. The curve in array should be bound curve.
Return Value
DetailCurveArray
 If successful an array of new detail curve elements. Otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown when curve is not in plane of the view
See Also
Reference
ItemFactoryBase Class
Autodesk.Revit.Creation Namespace